resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-12-01 四 14:26 -->
<meta charset="utf-8" />
<title>Seth Morabito</title>
<meta name="generator" content="Org Mode" />
<meta name="twitter:site" content="@twylo" />
<meta name="twitter:creator" content="@twylo" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="me" href="https://weibo.com/u/2150445074" />
<link rel="icon" type="image/png" href="/images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="/images/icon/apple-touch-icon.png" />
<link rel="alternate" type="application/rss+xml" title="Weblog RSS Feed" href="/blog/rss.xml" />
<link rel="stylesheet" type="text/css" href="/res/faces.css">
<link rel="stylesheet" type="text/css" href="/res/style.css">
</head>
<body>
<div id="preamble" class="status">
<a class="skip-nav-link" href="#content">
  Skip navigation
</a>
<nav>
  <div class="navitem"><a href="/">Home</a></div>
  <div class="navitem"><a href="/blog/">Weblog</a></div>
  <div class="navitem"><a href="/portfolio/">Portfolio</a></div>
  <div class="navitem"><a href="/resume.html">Resume</a></div>
  <div class="navitem"><a href="/contact.html">Contact</a></div>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Seth Morabito</h1>
</header><div class="resumecontact" id="org2d2ec1c">
<p>
web@loomcom.com &bull;
<a href="https://github.com/sethm/">github</a> &bull;
<a href="https://www.linkedin.com/in/sethmorabito">linkedin</a> &bull;
<a href="https://loomcom.com">homepage</a>
</p>

</div>

<div id="outline-container-org712e345" class="outline-2">
<h2 id="org712e345">Profile</h2>
<div class="outline-text-2" id="text-org712e345">
<p>
Accomplished, passionate, driven and creative software engineer with
extensive experience solving problems at every level of the
development lifecycle, from requirements analysis to deployment.
Strong team player with a love of the craft and a constant desire to
explore, create, and solve.  Comfortable working in both small and
large systems.  Core skills center around back end software for
Internet applications, object-oriented design, test driven
development, tool development, and API design. Never happy standing
still.
</p>
</div>
</div>

<div id="outline-container-org50a3fa9" class="outline-2 skills">
<h2 id="org50a3fa9">Core Skills</h2>
<div class="outline-text-2" id="text-org50a3fa9">
<dl class="org-dl">
<dt>Languages</dt><dd>Extensive professional experience with Java, Rust, C,
and Ruby. Other work and personal project experience with Python,
JavaScript, and C++.</dd>
<dt>Technologies</dt><dd>Linux, Docker, Apache Kafka, InfluxDB, Vertica,
PostgreSQL, MariaDB.</dd>
<dt>Fundamentals</dt><dd>Network &amp; Web, Stream Processing, Object-Oriented
Design, Functional Programming, Test-Driven Development,
Continuous Delivery, Virtualization.</dd>
</dl>
</div>
</div>

<div id="outline-container-org0f7e1b0" class="outline-2">
<h2 id="org0f7e1b0">Work Experience</h2>
<div class="outline-text-2" id="text-org0f7e1b0">
</div>
<div id="outline-container-org82b20f9" class="outline-3 work-experience">
<h3 id="org82b20f9">Akamai Technologies</h3>
<div class="outline-text-3" id="text-org82b20f9">
</div>
<div id="outline-container-org7270551" class="outline-4">
<h4 id="org7270551"><i>Senior Software Engineer II</i></h4>
</div>
<div id="outline-container-org36b4339" class="outline-4">
<h4 id="org36b4339">November 2017 &ndash; March 2022</h4>
<div class="outline-text-4" id="text-org36b4339">
<ul class="org-ul">
<li>Designed and built a Rust application that reuses existing C++
libraries and handles consuming over 10,000 Apache Kafka messages
per second, providing near real-time monitoring of our network's
provisioned state.</li>

<li>Engineered a Kafka Streams data aggregation and event detection
system that allows our customers to message their subscribers about
potential threats, and allows our network to gracefully handle
data center fail-over.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge8e2fe3" class="outline-3 work-experience">
<h3 id="orge8e2fe3">Nominum (acquired by Akamai in 2017)</h3>
<div class="outline-text-3" id="text-orge8e2fe3">
</div>
<div id="outline-container-org59e240f" class="outline-4">
<h4 id="org59e240f">Senior Staff Engineer</h4>
</div>
<div id="outline-container-org3afec94" class="outline-4">
<h4 id="org3afec94">October 2013 &ndash; November 2017</h4>
<div class="outline-text-4" id="text-org3afec94">
<p>
DNS-based threat detection and prevention system.
</p>

<ul class="org-ul">
<li>Designed a lock-free data structure to hold hundreds of thousands of
URLs in our HTTP proxy, reducing memory footprint and improving
response time.</li>

<li>Built a customer reporting solution using HPE Vertica and InfluxDB
capable of sustained ingest of thousands of rows per second.</li>

<li>Designed and built a RADIUS and DHCP IP Address change tracking
system capable of handling over 20,000 IP Address changes per
second.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6f75936" class="outline-3 work-experience">
<h3 id="org6f75936">Glyde Corporation</h3>
<div class="outline-text-3" id="text-org6f75936">
</div>
<div id="outline-container-orgbf75a82" class="outline-4">
<h4 id="orgbf75a82"><i>Senior Software Engineer</i></h4>
</div>
<div id="outline-container-orgfe4d7c1" class="outline-4">
<h4 id="orgfe4d7c1">December 2007 &ndash; July 2013</h4>
<div class="outline-text-4" id="text-orgfe4d7c1">
<p>
Innovative Consumer-to-Consumer marketplace.
</p>

<ul class="org-ul">
<li>Designed and built a fraud detection and prevention system that
reduced fraudulent activity by 80% and significantly increased
customer satisfaction.</li>

<li>Spearheaded integration of the Glyde Marketplace with PayPal (payment
and withdrawal), and Twilio (SMS messaging).</li>

<li>Implemented a cohort analysis system to analyze buying and selling
patterns to improve business strategy decision making.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3832851" class="outline-3 work-experience">
<h3 id="org3832851">Stanford University</h3>
<div class="outline-text-3" id="text-org3832851">
</div>
<div id="outline-container-orgdf021ba" class="outline-4">
<h4 id="orgdf021ba"><i>Software Engineer</i></h4>
</div>
<div id="outline-container-org94f2ef5" class="outline-4">
<h4 id="org94f2ef5">May 2004 &ndash; December 2007</h4>
<div class="outline-text-4" id="text-org94f2ef5">
<p>
Software Engineer with the LOCKSS Program at Stanford University.
LOCKSS ("Lots of Copies Keep Stuff Safe") is an Open Source,
distributed, peer-to-peer digital content preservation system used by
libraries world-wide to preserve digital journals.
</p>

<ul class="org-ul">
<li>Architected and implemented major portions of the new LOCKSS
peer-to-peer polling protocol (LCAP V3), resulting in a ten-fold
improvement in content auditing and repair efficiency over the
previous implementation.</li>

<li>Created a complete testing environment in Python for stress and
integration testing of the LOCKSS Network.</li>

<li>Designed and built a dynamic Java plugin extension system for
automatically finding and updating running LOCKSS systems with new
functionality.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orge5d991e" class="outline-2">
<h2 id="orge5d991e">Personal Projects</h2>
<div class="outline-text-2" id="text-orge5d991e">
</div>
<div id="outline-container-org6e304bc" class="outline-3 personal-project">
<h3 id="org6e304bc"><a href="./3b2/emulator.html">AT&amp;T 3B2/400 Simulator</a></h3>
<div class="outline-text-3" id="text-org6e304bc">
<p>
The 3B2 was a small, multi-user UNIX computer introduced in 1984 by
AT&amp;T.  It was the primary porting platform for UNIX System V Release
3, but has since faded into obscurity. I built a full system simulator
to allow running unmodified UNIX SVR3 software for historical
preservation. This project involved a tremendous amount of reverse
engineering both hardware and software, as internals documentation was
unavailable. Additionally, WE32100 assembler and disassemblers had to
be written from scratch. It is released as part of the SIMH historical
computer simulation framework.
</p>
</div>
</div>

<div id="outline-container-org0657676" class="outline-3 personal-project">
<h3 id="org0657676"><a href="https://github.com/sethm/symon">Symon 6502 Emulator</a></h3>
<div class="outline-text-3" id="text-org0657676">
<p>
Symon is an 8-bit system emulator, including full emulation of the
6502 CPU, 6551 ACIA, 6522 PIA, 6525 CRT controller, RAM, and ROM. It
is released under the MIT Open Source license.
</p>
</div>
</div>
</div>

<div id="outline-container-org4d32b50" class="outline-2 education">
<h2 id="org4d32b50">Education</h2>
<div class="outline-text-2" id="text-org4d32b50">
</div>
<div id="outline-container-org111bf57" class="outline-3">
<h3 id="org111bf57">Cornell University</h3>
<div class="outline-text-3" id="text-org111bf57">
<p>
Linguistics (1992-1995)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer">
Proudly <a href="https://blog.kinhung.me/blog/0110_emacs_blogging_for_fun_and_profit.html">published</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>. This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a> License. <a href="https://blog.kinhung.me/privacy.html">Privacy Policy</a></div>
</div>
</body>
</html>
